Revit 2024 API
FabricationPart.ProductSpecificationDescription Property
 The product specification description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string ProductSpecificationDescription { get; }
Visual Basic
Public ReadOnly Property ProductSpecificationDescription As String
	Get
Visual C++
public:
property String^ ProductSpecificationDescription {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace